const questions = [
    {
        text: 'Что такое IIFE, какую проблему решает? Приведите примеры использования',
    },
    {
        text: 'Что такое DOM? Как браузер создает DOM дерево? Какие свойства и методы есть у узлов в DOM дереве?',
    },
    {
        text: 'Как можно передать данные на сервер из браузера?. Приведите несколько примеров',
    },
    {
        text: 'Что такое websocket, как он работает?',
    },
    {
        text: 'Что такое event loop? Как работает?',
    },
    {
        text: 'В чем заключается задача "javascript bundling"? какие проблемы решаются?',
    },
    {
        text: 'Для чего нужен webpack-dev-server, как он работает?',
    },
    {
        text: 'Расскажите про назначение babeljs, как и какие задачи решает.',
    },
    {
        text: 'Назначение browserlist, как использовать в проекте, как работает browserlist',
    },
    {
        text: 'Назначение flux архитектуры, из каких элементов состоит, какие задачи решает?, Пример реализации flux',
    },
    {
        text: 'Назначение redux, как работает функция connect? Упрощеная реализация redux',
    },
    {
        text: 'CI/CD, постройте пайплайн для CI/CD в front-end проекте, какие инструменты используете? Какие задачи решает?',
    },
    {
        text: 'Тестирование. Что такое пирамида тестирования? Приведите пример тестов для каждого уровня',
    },
    {
        text: 'Какими способами может быть организована перерисовка представления при зменении данных в ui библиотеках?',
    },
    {
        text: 'Иммутабельность. Что такое иммутабельность? Какие проблемы решает? Как применяется в front-end? Как применяется в react? Приведите примеры',
    },
    {
        text: `Приведите пример кода на react / vuejs / angular etc,
        который предоставляет пользователю поле ввода текста, кнопку "добавить",
        список добавленных записей, напротив каждого элемента есть кнопка "удалить".
        При нажатии на кнопку "добавить" элемент с введенным текстом появляется в списке,
        поле ввода текста очищается`,
    },
    {
        text: `Приведите пример кода на react / vuejs / angular etc,
        который предоставляет пользователю список названий продуктов.
        При нажатии на продукт, вокруг него появляется рамка,
        а под списком появляется картинка с выбранным продуктом.`,
    }
];
