export const questions = [
    {
        text: 'Расскажите о назначении editorconfig, eslint, csslint, prettiefy',
        points: 3
    },
    {
        text: 'В чем заключается задача "javascript bundling"? какие проблемы решаются?',
        points: 3
    },
    {
        text: 'Что такое webpack-loader? Приведите пример устройства любого из существующих лоадеров',
        points: 3
    },
    {
        text: 'Что такое webpack-plugin? Приведите пример устройства любого из существующих плагинов',
        points: 3
    },
    {
        text: 'Для чего нужен webpack-dev-server, как он работает?',
        points: 3
    },
    {
        text: 'Расскажите про назначение babeljs, как и какие задачи решает.',
        points: 3
    },
    {
        text: 'Назначение browserlist, как использовать в проекте, как работает browserlist',
        points: 3
    },
    {
        text: 'Что такое react-create-app? Какие задачи решает, как работает?',
        points: 3
    },
    {
        text: `Опишите методы жизненного цикла компонента react и их назначение.
        (можно описывать классовый API или функциональный)`,
        points: 3
    },
    {
        text: 'Что такое jsx, как работает? Приведите примеры использования jsx',
        points: 3
    },
    {
        text: `Какими способами может быть организована перерисовка представления
        при зменении данных в ui библиотеках?`,
        points: 3
    },
    {
        text: 'Для чего в react компонентах нужен метод `shouldComponentUpdate`?',
        points: 3
    },
    {
        text: 'Назначение flux архитектуры, из каких элементов состоит, какие задачи решает?',
        points: 3
    },
    {
        text: 'Назначение redux, как работает функция connect',
        points: 3
    },
    {
        text: `Приведите пример кода на react / vuejs / angular etc,
        который предоставляет пользователю поле ввода текста, кнопку "добавить",
        список добавленных записей, напротив каждого элемента есть кнопка "удалить".
        При нажатии на кнопку "добавить" элемент с введенным текстом появляется в списке,
        поле ввода текста очищается`,
        points: 4
    },
    {
        text: `Приведите пример кода на react / vuejs / angular etc,
        который предоставляет пользователю список названий продуктов.
        При нажатии на продукт вокруг него появляется рамка,
        а под списком появляется картинка с выбранным продуктом.`,
        points: 4
    }
];
