export const questions = [
    {
        text: `
            Объявление идентификаторов в javascript.
            Опишите поведение идентификторов объявленных с помощью let, const, var.
        `,
        points: 2,
    },
    {
        text: 'Что такое IIFE? Какие задачи решает? Привести пример использования',
        points: 2
    },
    {
        text: `Что такое DOM?
        Приведите пример кода, который демонстрирует создание DOM элементов,
        добавление дочерних элементов, удаление элементов`,
        points: 2
    },
    {
        text: 'Приведите пример кода, который демонстрирует различные способы поиска DOM элементов с помощью DOM API',
        points: 2
    },
    {
        text: 'как подключить javascript на страницу. Приведите пример как минимум 2х разных способов.',
        points: 2,
    },
    {
        text: 'Напишите несколько примеров различных типов css селекторов. (от 3х)',
        points: 2
    },
    {
        text: 'как можно добавить обработчик события элементу?',
        points: 2
    },
    {
        text: 'для чего нужен метод Event.prototype.stopPropagation? привести пример использования',
        points: 2,
    },
    {
        text: 'для чего нужен метод preventDefault? привести пример',
        points: 2
    },
    {
        text: 'что такое http? назначение, из чего состоит httpRequest и httpResponse',
        points: 2
    },
    {
        text: 'как можно передать данные на сервер с помощью http. приведите несколько примеров',
        points: 2
    },
    {
        text: 'опишите разные типы статус кодов в http и их назначение',
        points: 1
    },
    {
        text: 'что такое uri? опишите схему uri',
        points: 1
    },
    {
        text: 'приведите пример кода выполнения http запроса из javascript и обработки ответа',
        points: 2
    },
    {
        text: 'что такое npm и для чего он нужен?',
        points: 1
    },
    {
        text: 'что такое semVer? приведите примеры разных описаний версий и что они значат',
        points: 1
    },
    {
        text: 'расскажите о разнице dependencies, devDependencies, optionalDependencies с примерами',
        points: 1
    },
    {
        text: 'для чего нужен файл package.json? опишите его примерную структуру',
        points: 2
    },
    {
        text: 'что такое nodejs, его назначение, преимущества, недостатки?',
        points: 2
    },

    {
        text: 'что такое longpolling, как он работает?',
        points: 3,
    },
    {
        text: 'что такое websocket, как он работает?',
        points: 3
    }
];