const questions = [
    {
        text: 'В чем заключается задача "bundling"? какие проблемы решаются и каким образом?',
    },
    {
        text: 'Для чего нужен webpack-dev-server, как он работает?',
    },
    {
        text: 'Расскажите про назначение babeljs, как и какие задачи решает.',
    },
    {
        text: 'Назначение browserlist, как использовать в проекте, как работает browserlist',
    },
    {
        text: 'Назначение flux архитектуры, из каких элементов состоит, какие задачи решает?, Реализуйте модули для flux, продемонстрируйте как использовать в вашем проекте',
    },
    {
        text: 'Назначение redux, как работает функция connect? Напишите простейшую реализацию redux',
    },
    {
        text: 'CI/CD, постройте пайплайн для CI/CD в front-end проекте, какие инструменты используете? Какие задачи решает?',
    },
    {
        text: 'Тестирование. Что такое пирамида тестирования? Приведите пример тестов для каждого уровня, продемонстрируйте тесты каждого уровня в вашем проекте',
    },
    {
        text: 'Какими способами может быть организована перерисовка представления при зменении данных в ui библиотеках?, Как это работает в библиотеке, которую используете вы?',
    },
    {
        text: 'Иммутабельность. Что такое иммутабельность? Какие проблемы решает? Как применяется в front-end? Как применяется в вашем проекте? Какие недостатки?',
    },
    {
        text: 'Как работает HTML5 event loop, какие проблемы решает?',
    },
    {
        text: 'WebWorkers. Atomics API, Какую проблему решают?. Приведите пример кода как с этим работать',
    },
    {
        text: 'WebAssembly, Какую проблему решает?',
    },
];
