export const firstGroup = [
    {
        text: 'как создать переменную в javascript? отличия let const var.',
        points: 2,
    },
    {
        text: 'что такое IIFE в javascript. Привести пример использования',
        points: 2
    },
    {
        text: 'что такое DOM?',
        points: 2
    },
    {
        text: 'как найти DOM element в javascript',
        points: 2
    },
    {
        text: 'как подключить javascript на страницу. Приведите пример как минимум 2х разных способов.',
        points: 2,
    },
    {
        text: 'Напишите несколько примеров различных типов css селекторов. (от 3х)',
        points: 2
    },
    {
        text: 'как можно добавить обработчик события элементу?',
        points: 2
    },

    {
        text: 'для чего нужно ключевое слово debugger.',
        points: 1
    },
    {
        text: 'для чего нужен console.log',
        points: 1
    },
    {
        text: 'для чего нужны метод stopPropagation? привести пример',
        points: 2,
    },
    {
        text: 'для чего нужен метод preventDefault? привести пример',
        points: 2
    },
    {
        text: 'что такое http? назначение, из чего состоит httpRequest и httpResponse',
        points: 2
    },
    {
        text: 'как можно передать данные на сервер с помощью http. приведите несколько примеров',
        points: 2
    },
    {
        text: 'опишите разные типы статус кодов в http и их назначение',
        points: 1
    },
    {
        text: 'что такое uri? опишите схему uri',
        points: 1
    },
    {
        text: 'приведите пример кода выполнения http запроса из javascript и обработки ответа',
        points: 2
    },
    {
        text: 'что такое npm и для чего он нужен?',
        points: 1
    },
    {
        text: 'что такое semVer? приведите примеры разных описаний версий и что они значат',
        points: 1
    },
    {
        text: 'расскажите о разнице dependencies, devDependencies, optionalDependencies с примерами',
        points: 1
    },
    {
        text: 'для чего нужен файл package.json? опишите его примерную структуру',
        points: 2
    },
    {
        text: 'что такое nodejs, его назначение, преимущества, недостатки?',
        points: 2
    },

    {
        text: 'что такое longpolling, как он работает?',
        points: 3,
    },
    {
        text: 'что такое websocket, как он работает?',
        points: 3
    }
];

export const secondGroup = [
    {
        text: 'Расскажите о назначении editorconfig, eslint, csslint, prettiefy',
        points: 3
    },
    {
        text: 'В чем заключается задача "javascript bundling"? какие проблемы решаются?',
        points: 3
    },
    {
        text: 'Что такое webpack-loader? Приведите пример устройства любого из существующих лоадеров',
        points: 3
    },
    {
        text: 'Что такое webpack-plugin? Приведите пример устройства любого из существующих плагинов',
        points: 3
    },
    {
        text: 'Для чего нужен webpack-dev-server, как он работает?',
        points: 3
    },
    {
        text: 'Расскажите про назначение babeljs, как и какие задачи решает.',
        points: 3
    },
    {
        text: 'Назначение browserlist, как использовать в проекте, как работает browserlist',
        points: 3
    },
    {
        text: 'Что такое react-create-app? Какие задачи решает, как работает?',
        points: 3
    },
    {
        text: `Опишите методы жизненного цикла компонента react и их назначение.
        (можно описывать классовый API или функциональный)`,
        points: 3
    },
    {
        text: 'Что такое jsx, как работает? Приведите примеры использования jsx',
        points: 3
    },
    {
        text: `Какими способами может быть организована перерисовка представления
        при зменении данных в ui библиотеках?`,
        points: 3
    },
    {
        text: 'Для чего в react компонентах нужен метод `shouldComponentUpdate`?',
        points: 3
    },
    {
        text: 'Назначение flux архитектуры, из каких элементов состоит, какие задачи решает?',
        points: 3
    },
    {
        text: 'Назначение redux, как работает функция connect',
        points: 3
    },
    {
        text: `Приведите пример кода на react / vuejs / angular etc,
        который предоставляет пользователю поле ввода текста, кнопку "добавить",
        список добавленных записей, напротив каждого элемента есть кнопка "удалить".
        При нажатии на кнопку "добавить" элемент с введенным текстом появляется в списке,
        поле ввода текста очищается`,
        points: 4
    },
    {
        text: `Приведите пример кода на react / vuejs / angular etc,
        который предоставляет пользователю список названий продуктов.
        При нажатии на продукт вокруг него появляется рамка,
        а под списком появляется картинка с выбранным продуктом.`,
        points: 4
    }
];
